app/controllers/events_controller.rb

    def create
        @event = current_user.created_events.build(event_params)

        if @event.save
---
INSERT INTO "events" ("date", "created_at", "updated_at", "creator_id", "title", "location") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def event_attendees
        @user = current_user
        user = (params[:id])
        @event = Event.find(params[:id])
        if @event.attendees.include?(@user.id)
            redirect_to root_path
        else
            @event.attendees<<@user
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "event_attendees" ("attendee_id", "attended_event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["attendee_id", 1], ["attended_event_id", 2], ["created_at", "2022-12-09 01:35:27.630480"], ["updated_at", "2022-12-09 01:35:27.630480"]]